minida28/PrayTime-LedMatrix-ESP8266/src/asyncserver.cpp
          RtcDateTime timeToSetToRTC;
          timeToSetToRTC.InitWithEpoch32Time(utcTimestamp);

          Rtc.SetDateTime(timeToSetToRTC);

          lastSyncRTC = utcTimestamp;

          setTime(utcTimestamp);
          _lastSyncd = utcTimestamp;

          DEBUGLOG("timeSync ");
        }
        else if (data[0] == 'm' && data[1] == ' ')
        {
          char *token = strtok((char *)&data[2], " ");
          time_t utcTimestamp = (unsigned long)strtol(token, '\0', 10);

          RtcDateTime timeToSetToRTC;
          timeToSetToRTC.InitWithEpoch32Time(utcTimestamp);

          Rtc.SetDateTime(timeToSetToRTC);

          lastSyncRTC = utcTimestamp;

          setTime(utcTimestamp);
          _lastSyncd = utcTimestamp;

          DEBUGLOG("timeSync ");
        }
        for (size_t i = 0; i < info->len; i++)
        {
          //msg += (char) data[i];
          char _data[2];
          _data[0] = (char)data[i];
          _data[1] = '\0';
          if (i == 0)
          {
            strcpy(msg, _data);
          }
          else
          {
            strcat(msg, _data);
          }
        }
      }
      else
      {
        char buff[3];
        for (size_t i = 0; i < info->len; i++)
        {
          sprintf(buff, "%02x ", (uint8_t)data[i]);
          //msg += buff ;
          if (i == 0)
          {
            strcpy(msg, buff);
          }
          else
          {
            strcat(msg, buff);
          }
        }
      }
      msg[len + 1] = '\0';
      DEBUGASYNCWS("%s\n", msg);
    }
    else
    {
      //message is comprised of multiple frames or the frame is split into multiple packets
      if (info->index == 0)
      {
        if (info->num == 0)
          DEBUGASYNCWS("ws[%s][%u] %s-message start\n", server->url(), client->id(), (info->message_opcode == WS_TEXT) ? "text" : "binary");
        DEBUGASYNCWS("ws[%s][%u] frame[%u] start[%llu]\n", server->url(), client->id(), info->num, info->len);
      }

      DEBUGASYNCWS("ws[%s][%u] frame[%u] %s[%llu - %llu]: ", server->url(), client->id(), info->num, (info->message_opcode == WS_TEXT) ? "text" : "binary", info->index, info->index + len);

      if (info->opcode == WS_TEXT)
      {
        for (size_t i = 0; i < info->len; i++)
        {
          //msg += (char) data[i];
          //strcat(msg, const_cast<char*>((char)data[i]));
          char _data[2];
          _data[0] = (char)data[i];
          _data[1] = '\0';
          if (i == 0)
          {
            strcpy(msg, _data);
          }
          else
          {
            strcat(msg, _data);
          }
        }
      }
      else
      {
        char buff[3];
        for (size_t i = 0; i < info->len; i++)
        {
          sprintf(buff, "%02x ", (uint8_t)data[i]);
          //msg += buff ;
          if (i == 0)
          {
            strcpy(msg, buff);
          }
          else
          {
            strcat(msg, buff);
          }
        }
      }
      msg[len + 1] = '\0';
      DEBUGASYNCWS("%s\n", msg);

      if ((info->index + len) == info->len)
      {
        DEBUGASYNCWS("ws[%s][%u] frame[%u] end[%llu]\n", server->url(), client->id(), info->num, info->len);
        if (info->final)
        {
          DEBUGASYNCWS("ws[%s][%u] %s-message end\n", server->url(), client->id(), (info->message_opcode == WS_TEXT) ? "text" : "binary");
          if (info->message_opcode == WS_TEXT)
            client->text(pgm_txt_gotyourtextmessage);
          else
            client->binary(pgm_txt_gotyourbinarymessage);
        }
      }
    }
  }
}

void AsyncWSBegin()
{
  DEBUGLOG("Async WebServer Init...\n");

  int reading = analogRead(A0);
  DEBUGLOG("Analog Read: %d\r\n", reading);
  if (reading >= 768)
  {                            // analog read 3 volts or more
    _apConfig.APenable = true; // Read AP button. If button is pressed, activate AP
    DEBUGLOG("AP Enable = %d\n", _apConfig.APenable);
  }

  //  if (!_fs) // If SPIFFS is not started
  //    _fs->begin();

  SPIFFS.begin();

#ifndef RELEASE
  { // List files
    //Dir dir = _fs->openDir("/");
    Dir dir = SPIFFS.openDir("/");
    while (dir.next())
    {
      String fileName = dir.fileName();
      size_t fileSize = dir.fileSize();

      PRINT("FS File: %s, size: %s\n", fileName.c_str(), formatBytes(fileSize).c_str());
    }
    PRINT("\n");
  }
#endif // RELEASE

  if (!load_config())
  { // Try to load configuration from file system
    //defaultConfig(); // Load defaults if any error
    _apConfig.APenable = true;
  }

  if (!load_config_time())
  {
    //create file if file not found
  }

  if (!load_config_sholat())
  {
    //create file if file not found
  }

  if (!load_config_runningled())
  {
    //create file if file not found
  }

  if (!load_config_httpauth())
  {
    //create file if file not found
  }

  //  loadHTTPAuth();

  // Register wifi Event to control connection LED
  onStationModeConnectedHandler = WiFi.onStationModeConnected([](WiFiEventStationModeConnected data) {
    onWiFiConnected(data);
  });
  //  onStationModeGotIPHandler = WiFi.onStationModeGotIP ([](WiFiEventStationModeGotIP data) {
  //    onWifiGotIP (data);
  //  });
  onStationModeGotIPHandler = WiFi.onStationModeGotIP(onWifiGotIP);
  onStationModeDisconnectedHandler = WiFi.onStationModeDisconnected([](WiFiEventStationModeDisconnected data) {
    onWiFiDisconnected(data);
  });

  //Set the host name
  char bufPrefix[] = "SHOLAT_";
  char bufChipId[11];
  itoa(ESP.getChipId(), bufChipId, 10);

  //char bufHostName[32];
  strlcpy(_config.hostname, bufPrefix, sizeof(_config.hostname));
  strncat(_config.hostname, bufChipId, sizeof(bufChipId));

  //_apConfig.APenable = true;

  WiFi.persistent(true);

  if (_apConfig.APenable)
  {
    PRINT("Starting wifi in WIFI_AP mode.\n");
    WiFi.mode(WIFI_OFF);
    WiFi.mode(WIFI_AP);
    WiFi.softAP(_config.hostname, NULL);
    WiFi.softAPConfig(IPAddress(192, 168, 4, 1), IPAddress(192, 168, 4, 1), IPAddress(255, 255, 255, 0));
  }
  if (!_apConfig.APenable)
  {
    if (!_config.dhcp)
    {
      PRINT("DHCP disabled, starting wifi in WIFI_STA mode with static IP.\n");
      WiFi.mode(WIFI_OFF);
      WiFi.mode(WIFI_STA);

