minida28/PrayTime-LedMatrix-ESP8266/src/asyncserver.cpp
      IPAddress static_ip;
      IPAddress gateway;
      IPAddress netmask;
      IPAddress dns0;
      IPAddress dns1;

      static_ip.fromString(_config.static_ip);
      gateway.fromString(_config.gateway);
      netmask.fromString(_config.netmask);
      dns0.fromString(_config.dns0);
      dns1.fromString(_config.dns1);

      WiFi.config(static_ip, gateway, netmask, dns0, dns1);
      WiFi.hostname(_config.hostname);
      WiFi.begin(_config.ssid, _config.password);
      WiFi.waitForConnectResult();
    }
    else
    {
      PRINT("DHCP enabled, starting wifi in WIFI_STA mode.\n");
      WiFi.mode(WIFI_OFF);
      WiFi.mode(WIFI_STA);
      WiFi.hostname(_config.hostname);
      WiFi.begin(_config.ssid, _config.password);
      WiFi.waitForConnectResult();
    }
  }

  PRINT("Host name: %s\n", WiFi.hostname().c_str());

  dnsServer.start(53, "*", WiFi.softAPIP());

  MDNS.addService("http", "tcp", 80);

  ArduinoOTA.setHostname(_config.hostname);
  ArduinoOTA.begin();

  /*
    if (!MDNS.begin(hostName)) {
      Serial.println(F("Error setting up MDNS responder!"));
    }
    Serial.println(F("mDNS responder started"));
    //MDNS.addService("esp", "tcp", 8080); // Announce esp tcp service on port 8080
    MDNS.addService("esp", "tcp", 80); // Announce esp tcp service on port 80

    Serial.println(F("Sending mDNS query"));
    int n = MDNS.queryService("esp", "tcp"); // Send out query for esp tcp services
    Serial.println(F("mDNS query done"));
    if (n == 0) {
      Serial.println(F("no services found"));
    }
    else {
      Serial.print(n);
      Serial.println(F(" service(s) found"));
      for (int i = 0; i < n; ++i) {
        // Print details for each service found
        Serial.print(i + 1);
        Serial.print(F(": "));
        Serial.print(MDNS.hostname(i));
        Serial.print(" (");
        Serial.print(MDNS.IP(i));
        Serial.print(":");
        Serial.print(MDNS.port(i));
        Serial.println(F(")"));
      }
    }
    Serial.println();
  */

  NBNS.begin(_config.hostname);

  SSDP.setSchemaURL(FPSTR(pgm_descriptionxml));
  SSDP.setHTTPPort(80);
  SSDP.setDeviceType(FPSTR(pgm_upnprootdevice));
  //  SSDP.setModelName(_config.deviceName.c_str());
  //  SSDP.setModelNumber(FPSTR(modelNumber));
  SSDP.begin();

  //SPIFFS.begin();

  ws.onEvent(onWsEvent);

  server.addHandler(&ws);

  events.onConnect([](AsyncEventSourceClient *client) {
    //client->send("hello!", NULL, millis(), 1000);
    if (client->lastId())
    {
      DEBUGLOG("Client reconnected! Last message ID that it gat is: %u\n", client->lastId());
    }
    //send event with message "hello!", id current millis
    // and set reconnect delay to 1 second
    //client->send("hello!", NULL, millis(), 1000);
    client->send("hello!");
    //EVENTS_send_information_values_html(client);

    if (clientVisitSystemStatusPage)
    {
      //EventSendSystemStatus();
    }

    // eventsourceTriggered = true;

    //_secondTk.attach(1.0f, s_secondTick, static_cast<void*>(client)); // Task to run periodic things every second
    //SendTimeData();
    //SendSholatTime();
  });
  server.addHandler(&events);

  //  sholattimeevent.onConnect([](AsyncEventSourceClient * client) {
  //    //client->send("hello!", NULL, millis(), 1000);
  //    //_secondTk.attach(1.0f, s_secondTick, static_cast<void*>(client)); // Task to run periodic things every second
  //  });
  //  server.addHandler(&sholattimeevent);

  server.addHandler(new SPIFFSEditor());

  server.on("/description.xml", HTTP_GET, [](AsyncWebServerRequest *request) {

    DEBUGASYNCWS("%s\r\n", __PRETTY_FUNCTION__);

    File configFile = SPIFFS.open(DESCRIPTION_XML_FILE, "r");
    if (!configFile)
    {
      PRINT("Failed to open config file\r\n");
      return;
    }

    size_t size = configFile.size();
    PRINT("DESCRIPTION_XML_FILE file size: %d bytes\r\n", size);
    if (size > 1024)
    {
      PRINT("WARNING, file size maybe too large\r\n");
    }

    // Allocate a buffer to store contents of the file
    char buf[size];

    //copy file to buffer
    configFile.readBytes(buf, size);

    //add termination character at the end
    buf[size] = '\0';

    //close the file, save your memory, keep healthy :-)
    configFile.close();

    PRINT("%s\r\n", buf);

    StreamString output;

    if (output.reserve(1024))
    {
      //convert IP address to char array
      size_t len = strlen(WiFi.localIP().toString().c_str());
      char URLBase[len + 1];
      strlcpy(URLBase, WiFi.localIP().toString().c_str(), sizeof(URLBase));

      const char *friendlyName = _config.hostname;
      char presentationURL[] = "index.htm";
      uint32_t serialNumber = ESP.getChipId();
      char modelName[] = "LS-01";
      const char *modelNumber = _config.hostname;
      //output.printf(ssdpTemplate,
      output.printf(buf,
                    URLBase,
                    friendlyName,
                    presentationURL,
                    serialNumber,
                    modelName,
                    modelNumber, //modelNumber
                    (uint8_t)((serialNumber >> 16) & 0xff),
                    (uint8_t)((serialNumber >> 8) & 0xff),
                    (uint8_t)serialNumber & 0xff);
      request->send(200, "text/xml", output);
    }
    else
    {
      request->send(500);
    }
  });

  server.serveStatic("/", SPIFFS, "/").setDefaultFile("index.htm");

  server.onNotFound([](AsyncWebServerRequest *request) {
    DEBUGLOG("NOT_FOUND: ");
    if (request->method() == HTTP_GET)
    {
      DEBUGLOG("GET");
    }
    else if (request->method() == HTTP_POST)
    {
      DEBUGLOG("POST");
    }
    else if (request->method() == HTTP_DELETE)
    {
      DEBUGLOG("DELETE");
    }
    else if (request->method() == HTTP_PUT)
    {
      DEBUGLOG("PUT");
    }
    else if (request->method() == HTTP_PATCH)
    {
      DEBUGLOG("PATCH");
    }
    else if (request->method() == HTTP_HEAD)
    {
      DEBUGLOG("HEAD");
    }
    else if (request->method() == HTTP_OPTIONS)
    {
      DEBUGLOG("OPTIONS");
    }
    else
    {
      DEBUGLOG("UNKNOWN");
    }
    DEBUGLOG("http://%s%s\n", request->host().c_str(), request->url().c_str());

    if (request->contentLength())
    {
      DEBUGLOG("_CONTENT_TYPE: %s\n", request->contentType().c_str());
      DEBUGLOG("_CONTENT_LENGTH: %u\n", request->contentLength());
    }

