minida28/PrayTime-LedMatrix-ESP8266/src/asyncserver.cpp
int apgm_lastIndexOf(uint8_t c, const char *p)
{
  int last_index = -1; // -1 indicates no match
  uint8_t b;
  for (int i = 0; true; i++)
  {
    b = pgm_read_byte(p++);
    if (b == c)
      last_index = i;
    else if (b == 0)
      break;
  }
  return last_index;
}

void EventSendSystemStatus()
{
  DEBUGLOG("%s\n", __PRETTY_FUNCTION__);

  uint32_t heap = ESP.getFreeHeap();

  /*
    const char *the_path = PSTR(__FILE__);

    int slash_loc = apgm_lastIndexOf('/', the_path); // index of last '/'
    if (slash_loc < 0) slash_loc = apgm_lastIndexOf('\\', the_path); // or last '\' (windows, ugh)

    int dot_loc = apgm_lastIndexOf('.', the_path);  // index of last '.'
    if (dot_loc < 0) dot_loc = apgm_lastIndexOf(0, the_path); // if no dot, return end of string

    char sketchname[64];
    int i;
    int n;
    for (i = slash_loc + 1; i < dot_loc; i++) {
    uint8_t b = pgm_read_byte(&the_path[i]);
    if (b != 0) {
      sketchname[n] = (char) b;
      n++;
    }
    else {
      break;
    }
    }
    sketchname[64] = '\0';
  */

  DynamicJsonBuffer jsonBuffer;
  JsonObject &root = jsonBuffer.createObject();

  root[FPSTR(pgm_heap)] = heap;
  //root[FPSTR(pgm_sketchname)] = sketchname;
  root[FPSTR(pgm_lastboot)] = getLastBootStr();
  root[FPSTR(pgm_chipid)] = ESP.getChipId();
  root[FPSTR(pgm_cpufreq)] = ESP.getCpuFreqMHz();
  root[FPSTR(pgm_sketchsize)] = ESP.getSketchSize();
  root[FPSTR(pgm_freesketchspace)] = ESP.getFreeSketchSpace();
  root[FPSTR(pgm_flashchipid)] = ESP.getFlashChipId();
  root[FPSTR(pgm_flashchipsize)] = ESP.getFlashChipSize();
  root[FPSTR(pgm_flashchiprealsize)] = ESP.getFlashChipRealSize();
  root[FPSTR(pgm_flashchipspeed)] = ESP.getFlashChipSpeed();
  root[FPSTR(pgm_cyclecount)] = ESP.getCycleCount();
  root[FPSTR(pgm_corever)] = ESP.getCoreVersion();
  root[FPSTR(pgm_sdkver)] = ESP.getSdkVersion();
  root[FPSTR(pgm_resetreason)] = ESP.getResetReason();

  size_t len = root.measureLength();
  char buf[len + 1];
  root.printTo(buf, len + 1);
  events.send(buf);
}

void WsSendSystemStatus()
{
  DEBUGLOG("%s\n", __PRETTY_FUNCTION__);

  uint32_t heap = ESP.getFreeHeap();

  /*
    const char *the_path = PSTR(__FILE__);

    int slash_loc = apgm_lastIndexOf('/', the_path); // index of last '/'
    if (slash_loc < 0) slash_loc = apgm_lastIndexOf('\\', the_path); // or last '\' (windows, ugh)

    int dot_loc = apgm_lastIndexOf('.', the_path);  // index of last '.'
    if (dot_loc < 0) dot_loc = apgm_lastIndexOf(0, the_path); // if no dot, return end of string

    char sketchname[64];
    int i;
    int n;
    for (i = slash_loc + 1; i < dot_loc; i++) {
    uint8_t b = pgm_read_byte(&the_path[i]);
    if (b != 0) {
      sketchname[n] = (char) b;
      n++;
    }
    else {
      break;
    }
    }
    sketchname[64] = '\0';
  */

  DynamicJsonBuffer jsonBuffer;
  JsonObject &root = jsonBuffer.createObject();

  root[FPSTR(pgm_heap)] = heap;
  //root[FPSTR(pgm_sketchname)] = sketchname;
  root[FPSTR(pgm_lastboot)] = getLastBootStr();
  root[FPSTR(pgm_chipid)] = ESP.getChipId();
  root[FPSTR(pgm_cpufreq)] = ESP.getCpuFreqMHz();
  root[FPSTR(pgm_sketchsize)] = ESP.getSketchSize();
  root[FPSTR(pgm_freesketchspace)] = ESP.getFreeSketchSpace();
  root[FPSTR(pgm_flashchipid)] = ESP.getFlashChipId();
  root[FPSTR(pgm_flashchipsize)] = ESP.getFlashChipSize();
  root[FPSTR(pgm_flashchiprealsize)] = ESP.getFlashChipRealSize();
  root[FPSTR(pgm_flashchipspeed)] = ESP.getFlashChipSpeed();
  root[FPSTR(pgm_cyclecount)] = ESP.getCycleCount();
  root[FPSTR(pgm_corever)] = ESP.getCoreVersion();
  root[FPSTR(pgm_sdkver)] = ESP.getSdkVersion();
  root[FPSTR(pgm_resetreason)] = ESP.getResetReason();

  size_t len = root.measureLength();
  char buf[len + 1];
  root.printTo(buf, len + 1);
  ws.text(clientID, buf);
}

void EventSendHeap()
{
  DEBUGLOG("%s\n", __PRETTY_FUNCTION__);

  uint32_t heap = ESP.getFreeHeap();

  DynamicJsonBuffer jsonBuffer;
  JsonObject &root = jsonBuffer.createObject();

  root[FPSTR(pgm_heap)] = heap;

  size_t len = root.measureLength();
  char buf[len + 1];
  root.printTo(buf, len + 1);
  events.send(buf);
}

void WsSendHeap()
{
  DEBUGLOG("%s\n", __PRETTY_FUNCTION__);

  uint32_t heap = ESP.getFreeHeap();

  DynamicJsonBuffer jsonBuffer;
  JsonObject &root = jsonBuffer.createObject();

  root[FPSTR(pgm_heap)] = heap;

  size_t len = root.measureLength();
  char buf[len + 1];
  root.printTo(buf, len + 1);
  ws.text(clientID, buf);
}

void send_NTP_configuration_values_html(AsyncWebServerRequest *request)
{
  DEBUGLOG("%s\n", __PRETTY_FUNCTION__);

  AsyncResponseStream *response = request->beginResponseStream("text/json");
  DynamicJsonBuffer jsonBuffer;
  JsonObject &root = jsonBuffer.createObject();
  root[FPSTR(pgm_enablentp)] = _config.enablentp;
  root[FPSTR(pgm_enablertc)] = _config.enablertc;
  root[FPSTR(pgm_timezone)] = _config.timezone;
  root[FPSTR(pgm_dst)] = _config.dst;
  root[FPSTR(pgm_ntpserver_0)] = _config.ntpserver_0;
  root[FPSTR(pgm_ntpserver_1)] = _config.ntpserver_1;
  root[FPSTR(pgm_ntpserver_2)] = _config.ntpserver_2;
  root[FPSTR(pgm_syncinterval)] = _config.syncinterval;

  root.printTo(*response);
  request->send(response);
}

void restart_esp(AsyncWebServerRequest *request)
{
  request->send_P(200, "text/html", Page_WaitAndReload);
  DEBUGLOG("%s\r\n", __PRETTY_FUNCTION__);
  SPIFFS.end(); // SPIFFS.end();

  /*
    GPIO 0  GPIO 2  GPIO 15
    UART Download Mode (Programming)  0       1       0
    Flash Startup (Normal)            1       1       0
    SD - Card Boot                      0       0       1
  */

  //WiFi.forceSleepBegin(); wdt_reset(); ESP.restart(); while(1)wdt_reset();

  //ESP.restart();

  restartESP.attach(1.0f, restart_1); // Task to run periodic things every second
}

void restart_1()
{
  digitalWrite(0, HIGH); //GPIO0
  digitalWrite(2, HIGH); //GPIO2
  digitalWrite(15, LOW); //GPIO15
  ESP.restart();
}

void reset_esp(AsyncWebServerRequest *request)
{
  request->send_P(200, "text/html", Page_WaitAndReload);
  DEBUGLOG("%s\r\n", __PRETTY_FUNCTION__);
  SPIFFS.end(); // SPIFFS.end();
  //delay(1000);
  //ESP.reset();
  restartESP.attach(1.0f, reset_1); // Task to run periodic things every second
}

void reset_1()
{
  digitalWrite(0, HIGH); //GPIO0
  digitalWrite(2, HIGH); //GPIO2
  digitalWrite(15, LOW); //GPIO15
  ESP.reset();
  //ESP.restart();
}

void send_wwwauth_configuration_values_html(AsyncWebServerRequest *request)
{
  DEBUGASYNCWS("%s\n", __PRETTY_FUNCTION__);

  AsyncResponseStream *response = request->beginResponseStream("text/plain");
  DynamicJsonBuffer jsonBuffer;
  JsonObject &root = jsonBuffer.createObject();
  if (_httpAuth.auth)
  {
    root["wwwauth"] = true;
  }
  else
  {
    root["wwwauth"] = false;
  }
  root["wwwuser"] = _httpAuth.wwwUsername;
  root["wwwpass"] = _httpAuth.wwwPassword;

  root.printTo(*response);
  request->send(response);
}

void send_wwwauth_configuration_html(AsyncWebServerRequest *request)
{
  DEBUGASYNCWS("%s %d\n", __FUNCTION__, request->args());

  //List all parameters
  int params = request->params();
  if (params)
  {
    for (int i = 0; i < params; i++)
    {
      AsyncWebParameter *p = request->getParam(i);
      if (p->isFile())
      { //p->isPost() is also true
        DEBUGASYNCWS("FILE[%s]: %s, size: %u\n", p->name().c_str(), p->value().c_str(), p->size());
      }
      else if (p->isPost())
      {
        DEBUGASYNCWS("POST[%s]: %s\n", p->name().c_str(), p->value().c_str());
        //      if (p->name() == "wwwauth") {
        //        _httpAuth.auth = p->value();
        //      }
        if (request->hasParam("wwwauth", true))
        {
          if (p->name() == "wwwauth")
          {
            _httpAuth.auth = p->value();
          }
          if (p->name() == "wwwuser")
          {
            strlcpy(_httpAuth.wwwUsername, p->value().c_str(), sizeof(_httpAuth.wwwUsername));
          }
          if (p->name() == "wwwpass")
          {
            strlcpy(_httpAuth.wwwPassword, p->value().c_str(), sizeof(_httpAuth.wwwPassword));
          }
        }
      }
      else
      {
        DEBUGASYNCWS("GET[%s]: %s\n", p->name().c_str(), p->value().c_str());
      }
    }
  }
  else
  {
    _httpAuth.auth = false;
  }

