minida28/PrayTime-LedMatrix-ESP8266/src/asyncserver.cpp
  //save settings
  saveHTTPAuth();

  // //Check if POST (but not File) parameter exists
  // if (request->hasParam("wwwauth", true))
  //   AsyncWebParameter* p = request->getParam("wwwauth", true);

  // //Check if POST (but not File) parameter exists
  // if (request->hasParam("wwwuser", true))
  //   AsyncWebParameter* p = request->getParam("wwwuser", true);

  // //Check if POST (but not File) parameter exists
  // if (request->hasParam("wwwpass", true))
  //   AsyncWebParameter* p = request->getParam("wwwpass", true);

  request->send(SPIFFS, request->url());
}

bool saveHTTPAuth()
{
  DEBUGASYNCWS("%s\n", __PRETTY_FUNCTION__);
  DEBUGASYNCWS("Save secret\r\n");
  DynamicJsonBuffer jsonBuffer;
  JsonObject &json = jsonBuffer.createObject();
  json["wwwauth"] = _httpAuth.auth;
  json["wwwuser"] = _httpAuth.wwwUsername;
  json["wwwpass"] = _httpAuth.wwwPassword;

  //TODO add AP data to html
  File file = SPIFFS.open(SECRET_FILE, "w");
  if (!file)
  {
    DEBUGASYNCWS("Failed to open secret file for writing\r\n");
    file.close();
    return false;
  }

#ifndef RELEASEASYNCWS
  json.prettyPrintTo(DEBUGPORT);
  DEBUGASYNCWS("\r\n");
#endif // RELEASE

  json.prettyPrintTo(file);
  file.flush();
  file.close();
  return true;
}

void send_update_firmware_values_html(AsyncWebServerRequest *request)
{
  String values = "";
  uint32_t maxSketchSpace = (ESP.getSketchSize() - 0x1000) & 0xFFFFF000;
  //bool updateOK = Update.begin(maxSketchSpace);
  bool updateOK = maxSketchSpace < ESP.getFreeSketchSpace();
  StreamString result;
  Update.printError(result);
  DEBUGLOG("--MaxSketchSpace: %d\n", maxSketchSpace);
  DEBUGLOG("--Update error = %s\n", result.c_str());
  values += "remupd|" + (String)((updateOK) ? "OK" : "ERROR") + "|div\n";

  if (Update.hasError())
  {
    result.trim();
    values += "remupdResult|" + result + "|div\n";
  }
  else
  {
    values += "remupdResult||div\n";
  }

  request->send(200, "text/plain", values);
  DEBUGLOG("%s\r\n", __PRETTY_FUNCTION__);
}

void setUpdateMD5(AsyncWebServerRequest *request)
{
  _browserMD5 = "";
  DEBUGLOG("Arg number: %d\r\n", request->args());
  if (request->args() > 0) // Read hash
  {
    for (uint8_t i = 0; i < request->args(); i++)
    {
      DEBUGLOG("Arg %s: %s\r\n", request->argName(i).c_str(), request->arg(i).c_str());
      if (request->argName(i) == "md5")
      {
        _browserMD5 = urldecode(request->arg(i));
        Update.setMD5(_browserMD5.c_str());
        continue;
      }
      if (request->argName(i) == "size")
      {
        _updateSize = request->arg(i).toInt();
        DEBUGLOG("Update size: %l\r\n", _updateSize);
        continue;
      }
    }
    request->send(200, "text/html", "OK --> MD5: " + _browserMD5);
  }
}

void updateFirmware(AsyncWebServerRequest *request, String filename, size_t index, uint8_t *data, size_t len, bool final)
{
  // handler for the file upload, get's the sketch bytes, and writes
  // them through the Update object
  static unsigned long totalSize = 0;
  if (!index)
  { //UPLOAD_FILE_START
    SPIFFS.end();
    Update.runAsync(true);
    DEBUGASYNCWS("Update start: %s\n", filename.c_str());
    uint32_t maxSketchSpace = ESP.getSketchSize();
    DEBUGASYNCWS("Max free scketch space: %u\n", maxSketchSpace);
    DEBUGASYNCWS("New scketch size: %u\n", _updateSize);
    if (_browserMD5 != NULL && _browserMD5 != "")
    {
      Update.setMD5(_browserMD5.c_str());
      DEBUGASYNCWS("Hash from client: %s\n", _browserMD5.c_str());
    }
    if (!Update.begin(_updateSize))
    { //start with max available size
      Update.printError(DEBUGPORT);
    }
  }

  // Get upload file, continue if not start
  totalSize += len;
  DEBUGASYNCWS(".");
  size_t written = Update.write(data, len);
  if (written != len)
  {
    DEBUGASYNCWS("len = %d, written = %zu, totalSize = %lu\r\n", len, written, totalSize);
    //Update.printError(PRINTPORT);
    //return;
  }
  if (final)
  { // UPLOAD_FILE_END
    String updateHash;
    DEBUGASYNCWS("\r\nApplying update...\r\n");
    if (Update.end(true))
    { //true to set the size to the current progress
      updateHash = Update.md5String();
      DEBUGASYNCWS("Upload finished. Calculated MD5: %s\n", updateHash.c_str());
      DEBUGASYNCWS("Update Success: %u\nRebooting...\n", request->contentLength());
    }
    else
    {
      updateHash = Update.md5String();
      DEBUGASYNCWS("Upload failed. Calculated MD5: %s\n", updateHash.c_str());
      Update.printError(PRINTPORT);
    }
  }

  //delay(2);
}

void send_sholat_values_html(AsyncWebServerRequest *request)
{
  DEBUGLOG("%s\n", __PRETTY_FUNCTION__);

  AsyncResponseStream *response = request->beginResponseStream("application/json");
  DynamicJsonBuffer jsonBuffer;
  JsonObject &root = jsonBuffer.createObject();

  root[FPSTR(pgm_day)] = dayNameStr(weekday(local_time()));
  root[FPSTR(pgm_date)] = getDateStr(local_time());
  root[FPSTR(pgm_fajr)] = sholatTimeArray[0];
  root[FPSTR(pgm_syuruq)] = sholatTimeArray[1];
  root[FPSTR(pgm_dhuhr)] = sholatTimeArray[2];
  root[FPSTR(pgm_ashr)] = sholatTimeArray[3];
  root[FPSTR(pgm_maghrib)] = sholatTimeArray[5];
  root[FPSTR(pgm_isya)] = sholatTimeArray[6];
  root[FPSTR(pgm_h)] = bufHOUR;
  root[FPSTR(pgm_m)] = bufMINUTE;
  root[FPSTR(pgm_s)] = bufSECOND;
  root[FPSTR(pgm_curr)] = sholatNameStr(CURRENTTIMEID);
  root[FPSTR(pgm_next)] = sholatNameStr(NEXTTIMEID);
  root.printTo(*response);
  request->send(response);
}

void WsSendConfigSholat()
{
  //  DEBUGASYNCWS("%s\n", __PRETTY_FUNCTION__);
  //
  //  DynamicJsonBuffer jsonBuffer;
  //  JsonObject &root = jsonBuffer.createObject();
  //
  //  root[FPSTR(pgm_location)] = _sholatConfig.citySholat;
  //  root[FPSTR(pgm_latitude)] = _sholatConfig.latitudeSholat;
  //  root[FPSTR(pgm_longitude)] = _sholatConfig.longitudeSholat;
  //  root[FPSTR(pgm_timezone)] = _sholatConfig.timeZoneSholat;
  //
  //  // calcMethod
  //  if (_sholatConfig.calcMethod == Jafari) {
  //    root[FPSTR(pgm_calcMethod)] = FPSTR(pgm_Jafari);
  //  }
  //  else if (_sholatConfig.calcMethod == Karachi) {
  //    root[FPSTR(pgm_calcMethod)] = FPSTR(pgm_Karachi);
  //  }
  //  else if (_sholatConfig.calcMethod == ISNA) {
  //    root[FPSTR(pgm_calcMethod)] = FPSTR(pgm_ISNA);
  //  }
  //  else if (_sholatConfig.calcMethod == MWL) {
  //    root[FPSTR(pgm_calcMethod)] = FPSTR(pgm_MWL);
  //  }
  //  else if (_sholatConfig.calcMethod == Makkah) {
  //    root[FPSTR(pgm_calcMethod)] = FPSTR(pgm_Makkah);
  //  }
  //  else if (_sholatConfig.calcMethod == Egypt) {
  //    root[FPSTR(pgm_calcMethod)] = FPSTR(pgm_Egypt);
  //  }
  //  else if (_sholatConfig.calcMethod == Custom) {
  //    root[FPSTR(pgm_calcMethod)] = FPSTR(pgm_Custom);
  //  }
  //
  //  //asrMethod
  //  if (_sholatConfig.asrJuristic == Shafii) {
  //    root[FPSTR(pgm_asrMethod)] = 0;
  //  }
  //  else if (_sholatConfig.asrJuristic == Hanafi) {
  //    root[FPSTR(pgm_asrMethod)] = 1;
  //  }
  //
  //  // highLatsAdjustMethod
  //  uint8_t highLatsAdjustMethod = root[FPSTR(pgm_highLatsAdjustMethod)];
  //  if (_sholatConfig.highLatsAdjustMethod == None) {
  //    root[FPSTR(pgm_highLatsAdjustMethod)] = 0;
  //  }
  //  else if (_sholatConfig.highLatsAdjustMethod == MidNight) {
  //    root[FPSTR(pgm_highLatsAdjustMethod)] = 1;
  //  }
  //  else if (_sholatConfig.highLatsAdjustMethod == OneSeventh) {
  //    root[FPSTR(pgm_highLatsAdjustMethod)] = 2;
  //  }
  //  else if (_sholatConfig.highLatsAdjustMethod == AngleBased) {
  //    root[FPSTR(pgm_highLatsAdjustMethod)] = 3;
  //  }
  //
  //  root[FPSTR(pgm_fajrAngle)] = _sholatConfig.fajrAngle;
  //  root[FPSTR(pgm_maghribAngle)] = _sholatConfig.maghribAngle;
  //  root[FPSTR(pgm_ishaAngle)] = _sholatConfig.ishaAngle;
  //  root[FPSTR(pgm_offsetImsak)] = _sholatConfig.offsetImsak;
  //  root[FPSTR(pgm_offsetFajr)] = _sholatConfig.offsetFajr;
  //  root[FPSTR(pgm_offsetSunrise)] = _sholatConfig.offsetSunrise;
  //  root[FPSTR(pgm_offsetDhuhr)] = _sholatConfig.offsetDhuhr;
  //  root[FPSTR(pgm_offsetAsr)] = _sholatConfig.offsetAsr;
  //  root[FPSTR(pgm_offsetSunset)] = _sholatConfig.offsetSunset;
  //  root[FPSTR(pgm_offsetMaghrib)] = _sholatConfig.offsetMaghrib;
  //  root[FPSTR(pgm_offsetIsha)] = _sholatConfig.offsetIsha;
  //
  //  size_t len = root.measureLength();
  //  char buf[len + 1];
  //  root.printTo(buf, sizeof(buf));
  //  ws.text(clientID, buf);
}

