minida28/PrayTime-LedMatrix-ESP8266/src/asyncserver.cpp
void set_RTC_TIME_html(AsyncWebServerRequest *request)
{
  DEBUGASYNCWS("%s\r\n", __PRETTY_FUNCTION__);

  //List all parameters
  int params = request->params();
  for (int i = 0; i < params; i++)
  {
    AsyncWebParameter *p = request->getParam(i);
    if (p->isFile())
    { //p->isPost() is also true
      Serial.printf("FILE[%s]: %s, size: %u\n", p->name().c_str(), p->value().c_str(), p->size());
    }
    else if (p->isPost())
    {
      Serial.printf("POST[%s]: %s\n", p->name().c_str(), p->value().c_str());
    }
    else
    {
      Serial.printf("GET[%s]: %s\n", p->name().c_str(), p->value().c_str());
    }
  }

  // //Check if GET parameter exists
  // if (request->hasParam("download"))
  //   AsyncWebParameter* p = request->getParam("download");

  // //Check if POST (but not File) parameter exists
  // if (request->hasParam("download", true))
  //   AsyncWebParameter* p = request->getParam("download", true);

  // //Check if FILE was uploaded
  // if (request->hasParam("download", true, true))
  //   AsyncWebParameter* p = request->getParam("download", true, true);

  //handleFileRead("/setrtctime.html", request);
  request->send(SPIFFS, request->url());
}

bool load_config()
{
  DEBUGASYNCWS("%s\r\n", __PRETTY_FUNCTION__);

  File file = SPIFFS.open(FPSTR(pgm_configfilenetwork), "r");
  if (!file)
  {
    DEBUGASYNCWS("Failed to open config file\n");
    return false;
  }

  size_t size = file.size();
  DEBUGASYNCWS("JSON file size: %d bytes\r\n", size);

  // Allocate a buffer to store contents of the file
  char buf[size];

  //copy file to buffer
  file.readBytes(buf, size);

  //add termination character at the end
  buf[size] = '\0';

  //close the file, save your memory, keep healthy :-)
  file.close();

  DynamicJsonBuffer jsonBuffer;
  JsonObject &root = jsonBuffer.parseObject(buf);

  if (!root.success())
  {
    DEBUGASYNCWS("Failed to parse config file\r\n");
    return false;
  }

#ifndef RELEASEASYNCWS
  root.prettyPrintTo(DEBUGPORT);
#endif

  strlcpy(_config.ssid, root[FPSTR(pgm_ssid)], sizeof(_config.ssid));
  strlcpy(_config.password, root[FPSTR(pgm_password)], sizeof(_config.password));
  strlcpy(_config.static_ip, root[FPSTR(pgm_static_ip)], sizeof(_config.static_ip));
  strlcpy(_config.netmask, root[FPSTR(pgm_netmask)], sizeof(_config.netmask));
  strlcpy(_config.gateway, root[FPSTR(pgm_gateway)], sizeof(_config.gateway));
  strlcpy(_config.dns0, root[FPSTR(pgm_dns0)], sizeof(_config.dns0));
  strlcpy(_config.dns1, root[FPSTR(pgm_dns1)], sizeof(_config.dns1));
  _config.dhcp = root[FPSTR(pgm_dhcp)];

  DEBUGASYNCWS("\r\nConfig loaded successfully.\r\n");
  DEBUGASYNCWS("SSID: %s ", _config.ssid);
  DEBUGASYNCWS("PASS: %s\r\n", _config.password);
  DEBUGASYNCWS("NTP Server: %s\r\n", _config.ntpserver_0);

  return true;
}

bool load_config_time()
{
  DEBUGASYNCWS("%s\r\n", __PRETTY_FUNCTION__);

  File file = SPIFFS.open(FPSTR(pgm_configfiletime), "r");
  if (!file)
  {
    DEBUGASYNCWS("Failed to open config file\n");
    return false;
  }

  size_t size = file.size();
  DEBUGASYNCWS("JSON file size: %d bytes\r\n", size);

  // Allocate a buffer to store contents of the file
  char buf[size];

  //copy file to buffer
  file.readBytes(buf, size);

  //add termination character at the end
  buf[size] = '\0';

  //close the file, save your memory, keep healthy :-)
  file.close();

  DynamicJsonBuffer jsonBuffer;
  JsonObject &root = jsonBuffer.parseObject(buf);

  if (!root.success())
  {
    DEBUGASYNCWS("Failed to parse config file\r\n");
    return false;
  }

#ifndef RELEASEASYNCWS
  root.prettyPrintTo(DEBUGPORT);
  DEBUGASYNCWS("\n");

#endif

  _config.timezone = root[FPSTR(pgm_timezone)];
  _config.dst = root[FPSTR(pgm_dst)];
  _config.enablertc = root[FPSTR(pgm_enablertc)];
  _config.enablentp = root[FPSTR(pgm_enablentp)];
  strlcpy(_config.ntpserver_0, root[FPSTR(pgm_ntpserver_0)], sizeof(_config.ntpserver_0));
  strlcpy(_config.ntpserver_1, root[FPSTR(pgm_ntpserver_1)], sizeof(_config.ntpserver_1));
  strlcpy(_config.ntpserver_2, root[FPSTR(pgm_ntpserver_2)], sizeof(_config.ntpserver_2));
  _config.syncinterval = root[FPSTR(pgm_syncinterval)];

  //check
  DEBUGASYNCWS("Time settings loaded successfully.\r\n");
  DEBUGASYNCWS("timezone: %ld\r\n", _config.timezone);
  DEBUGASYNCWS("dst: %d\r\n", _config.dst);
  DEBUGASYNCWS("syncinterval: %lu\r\n", _config.syncinterval);
  DEBUGASYNCWS("enablertc: %d\r\n", _config.enablertc);
  DEBUGASYNCWS("enablentp: %d\r\n", _config.enablentp);
  DEBUGASYNCWS("ntpserver_0: %s\r\n", _config.ntpserver_0);
  DEBUGASYNCWS("ntpserver_1: %s\r\n", _config.ntpserver_1);
  DEBUGASYNCWS("ntpserver_2: %s\r\n", _config.ntpserver_2);

  return true;
}

bool load_config_sholat()
{
  DEBUGASYNCWS("\n%s\r\n", __PRETTY_FUNCTION__);

  File file = SPIFFS.open(FPSTR(pgm_configfilesholat), "r");
  if (!file)
  {
    DEBUGASYNCWS("Failed to open config file\n");
    return false;
  }

  size_t size = file.size();
  DEBUGASYNCWS("JSON file size: %d bytes\r\n", size);

  // Allocate a buffer to store contents of the file
  char buf[size];

  //copy file to buffer
  file.readBytes(buf, size);

  //add termination character at the end
  buf[size] = '\0';

  //close the file, save your memory, keep healthy :-)
  file.close();

  DynamicJsonBuffer jsonBuffer;
  JsonObject &root = jsonBuffer.parseObject(buf);

  if (!root.success())
  {
    DEBUGASYNCWS("Failed to parse config file\r\n");
    return false;
  }

#ifndef RELEASEASYNCWS
  root.prettyPrintTo(DEBUGPORT);
  DEBUGASYNCWS("\n");

#endif

  strlcpy(_sholatConfig.location, root[FPSTR(pgm_location)], sizeof(_sholatConfig.location));
  _sholatConfig.latitude = root[FPSTR(pgm_latitude)];
  _sholatConfig.longitude = root[FPSTR(pgm_longitude)];
  _sholatConfig.timezone = root[FPSTR(pgm_timezone)];

  const char *calcMethod = root[FPSTR(pgm_calcMethod)];
  int len = strlen(calcMethod);
  if (strncmp_P(calcMethod, pgm_Jafari, len) == 0)
  {
    _sholatConfig.calcMethod = Jafari;
  }
  else if (strncmp_P(calcMethod, pgm_Karachi, len) == 0)
  {
    _sholatConfig.calcMethod = Karachi;
  }
  else if (strncmp_P(calcMethod, pgm_ISNA, len) == 0)
  {
    _sholatConfig.calcMethod = ISNA;
  }
  else if (strncmp_P(calcMethod, pgm_MWL, len) == 0)
  {
    _sholatConfig.calcMethod = MWL;
  }
  else if (strncmp_P(calcMethod, pgm_Makkah, len) == 0)
  {
    _sholatConfig.calcMethod = Makkah;
  }
  else if (strncmp_P(calcMethod, pgm_Egypt, len) == 0)
  {
    _sholatConfig.calcMethod = Egypt;
  }
  else if (strncmp_P(calcMethod, pgm_Custom, len) == 0)
  {
    _sholatConfig.calcMethod = Custom;
  }

  //asrMethod
  uint8_t asrMethod = root[FPSTR(pgm_asrMethod)];
  if (asrMethod == 0)
  {
    _sholatConfig.asrJuristic = Shafii;
  }
  else if (asrMethod == 1)
  {
    _sholatConfig.asrJuristic = Hanafi;
  }

