minida28/PrayTime-LedMatrix-ESP8266/src/asyncserver.cpp
  // highLatsAdjustMethod
  uint8_t highLatsAdjustMethod = root[FPSTR(pgm_highLatsAdjustMethod)];
  if (highLatsAdjustMethod == 0)
  {
    _sholatConfig.highLatsAdjustMethod = None;
  }
  else if (highLatsAdjustMethod == 1)
  {
    _sholatConfig.highLatsAdjustMethod = MidNight;
  }
  else if (highLatsAdjustMethod == 2)
  {
    _sholatConfig.highLatsAdjustMethod = OneSeventh;
  }
  else if (highLatsAdjustMethod == 3)
  {
    _sholatConfig.highLatsAdjustMethod = AngleBased;
  }

  _sholatConfig.fajrAngle = root[FPSTR(pgm_fajrAngle)].as<uint16_t>();
  _sholatConfig.maghribAngle = root[FPSTR(pgm_maghribAngle)].as<uint16_t>();
  _sholatConfig.ishaAngle = root[FPSTR(pgm_ishaAngle)].as<uint16_t>();
  _sholatConfig.offsetImsak = root[FPSTR(pgm_offsetImsak)].as<float>();
  _sholatConfig.offsetFajr = root[FPSTR(pgm_offsetFajr)].as<float>();
  _sholatConfig.offsetSunrise = root[FPSTR(pgm_offsetSunrise)].as<float>();
  _sholatConfig.offsetDhuhr = root[FPSTR(pgm_offsetDhuhr)].as<float>();
  _sholatConfig.offsetAsr = root[FPSTR(pgm_offsetAsr)].as<float>();
  _sholatConfig.offsetSunset = root[FPSTR(pgm_offsetSunset)].as<float>();
  _sholatConfig.offsetMaghrib = root[FPSTR(pgm_offsetMaghrib)].as<float>();
  _sholatConfig.offsetIsha = root[FPSTR(pgm_offsetIsha)].as<float>();

  //check
  DEBUGASYNCWS("\nSholat settings loaded successfully.\r\n");
  DEBUGASYNCWS("location: %s\r\n", _sholatConfig.location);
  DEBUGASYNCWS("latitude: %f\r\n", _sholatConfig.latitude);
  DEBUGASYNCWS("longitude: %f\r\n", _sholatConfig.longitude);
  DEBUGASYNCWS("timezone: %d\r\n", _sholatConfig.timezone);
  DEBUGASYNCWS("calcMethod: %d\r\n", _sholatConfig.calcMethod);
  DEBUGASYNCWS("asrJuristic: %d\r\n", _sholatConfig.asrJuristic);
  DEBUGASYNCWS("highLatsAdjustMethod: %d\r\n", _sholatConfig.highLatsAdjustMethod);
  DEBUGASYNCWS("fajrAngle: %d\r\n", _sholatConfig.fajrAngle);
  DEBUGASYNCWS("maghribAngle: %d\r\n", _sholatConfig.maghribAngle);
  DEBUGASYNCWS("ishaAngle: %d\r\n", _sholatConfig.ishaAngle);
  DEBUGASYNCWS("offsetImsak: %.1f\r\n", _sholatConfig.offsetImsak);
  DEBUGASYNCWS("offsetFajr: %.1f\r\n", _sholatConfig.offsetFajr);
  DEBUGASYNCWS("offsetSunrise: %.1f\r\n", _sholatConfig.offsetSunrise);
  DEBUGASYNCWS("offsetDhuhr: %.1f\r\n", _sholatConfig.offsetDhuhr);
  DEBUGASYNCWS("offsetAsr: %.1f\r\n", _sholatConfig.offsetAsr);
  DEBUGASYNCWS("offsetSunset: %.1f\r\n", _sholatConfig.offsetSunset);
  DEBUGASYNCWS("offsetMaghrib: %.1f\r\n", _sholatConfig.offsetMaghrib);
  DEBUGASYNCWS("offsetIsha: %.1f\r\n", _sholatConfig.offsetIsha);

  return true;
}

bool load_config_runningled()
{
  DEBUGASYNCWS("\n%s\r\n", __PRETTY_FUNCTION__);

  File file = SPIFFS.open(FPSTR(pgm_configfilerunningled), "r");
  if (!file)
  {
    DEBUGASYNCWS("Failed to open config file\n");
    return false;
  }

  size_t size = file.size();
  DEBUGASYNCWS("JSON file size: %d bytes\r\n", size);

  // Allocate a buffer to store contents of the file
  char buf[size];

  //copy file to buffer
  file.readBytes(buf, size);

  //add termination character at the end
  buf[size] = '\0';

  //close the file, save your memory, keep healthy :-)
  file.close();

  DynamicJsonBuffer jsonBuffer;
  JsonObject &root = jsonBuffer.parseObject(buf);

  if (!root.success())
  {
    DEBUGASYNCWS("Failed to parse config file\r\n");
    return false;
  }

#ifndef RELEASEASYNCWS
  root.prettyPrintTo(DEBUGPORT);
  DEBUGASYNCWS("\n");

#endif

  uint8_t op = root[FPSTR(pgm_operatingmode)];

  if (op == 0)
  {
    _ledMatrixSettings.operatingmode = Normal;
  }
  else if (op == 1)
  {
    _ledMatrixSettings.operatingmode = Config;
  }
  else if (op == 2)
  {
    _ledMatrixSettings.operatingmode = Edit;
  }

  const char *pagemode = root[FPSTR(pgm_pagemode)];
  int len = strlen(pagemode);
  if (strncmp_P(pagemode, pgm_automatic, len) == 0)
  {
    _ledMatrixSettings.pagemode = Automatic;
  }
  else
  {
    _ledMatrixSettings.pagemode = Manual;
  }

  _ledMatrixSettings.pagemode0 = root[FPSTR(pgm_pagemode0)];
  _ledMatrixSettings.pagemode1 = root[FPSTR(pgm_pagemode1)];
  _ledMatrixSettings.pagemode2 = root[FPSTR(pgm_pagemode2)];
  _ledMatrixSettings.scrollrow_0 = root[FPSTR(pgm_scrollrow_0)];
  _ledMatrixSettings.scrollrow_1 = root[FPSTR(pgm_scrollrow_1)];
  _ledMatrixSettings.scrollspeed = root[FPSTR(pgm_scrollspeed)];
  _ledMatrixSettings.brightness = root[FPSTR(pgm_brightness)];

  MODE = op;
  currentPageMode0 = _ledMatrixSettings.pagemode0;
  currentPageMode1 = _ledMatrixSettings.pagemode1;
  currentPageMode2 = _ledMatrixSettings.pagemode2;

  //check
  DEBUGASYNCWS("\nLed-Matrix settings loaded successfully.\r\n");
  DEBUGASYNCWS("operatingmode: %d\r\n", _ledMatrixSettings.operatingmode);
  DEBUGASYNCWS("pagemode: %d\r\n", _ledMatrixSettings.pagemode);
  DEBUGASYNCWS("pagemode0: %d\r\n", _ledMatrixSettings.pagemode0);
  DEBUGASYNCWS("pagemode1: %d\r\n", _ledMatrixSettings.pagemode1);
  DEBUGASYNCWS("pagemode2: %d\r\n", _ledMatrixSettings.pagemode2);
  DEBUGASYNCWS("scrollrow_0: %d\r\n", _ledMatrixSettings.scrollrow_0);
  DEBUGASYNCWS("scrollrow_1: %d\r\n", _ledMatrixSettings.scrollrow_1);
  DEBUGASYNCWS("scrollspeed: %d\r\n", _ledMatrixSettings.scrollspeed);
  DEBUGASYNCWS("brightness: %d\r\n", _ledMatrixSettings.brightness);

  return true;
}

bool load_config_httpauth()
{
  DEBUGASYNCWS("\n%s\r\n", __PRETTY_FUNCTION__);

  File file = SPIFFS.open("/secret.json", "r");
  if (!file)
  {
    DEBUGASYNCWS("Failed to open file\n");
    return false;
  }

  size_t size = file.size();
  DEBUGASYNCWS("JSON file size: %d bytes\r\n", size);

  // Allocate a buffer to store contents of the file
  char buf[size];

  //copy file to buffer
  file.readBytes(buf, size);

  //add termination character at the end
  buf[size] = '\0';

  //close the file, save your memory, keep healthy :-)
  file.close();

  DynamicJsonBuffer jsonBuffer;
  JsonObject &root = jsonBuffer.parseObject(buf);

  if (!root.success())
  {
    DEBUGASYNCWS("Failed to parse json file\r\n");
    return false;
  }

#ifndef RELEASEASYNCWS
  root.prettyPrintTo(DEBUGPORT);
  DEBUGASYNCWS("\n");
#endif

  if (
      !root["wwwauth"].success() ||
      !root["wwwuser"].success() ||
      !root["wwwpass"].success())
  {
    DEBUGASYNCWS("Failed to parse httpAuth json file\r\n");
    return false;
  }

