minida28/PrayTime-LedMatrix-ESP8266/src/asyncserver.cpp
  _httpAuth.auth = root["wwwauth"];
  strlcpy(_httpAuth.wwwUsername, root["wwwuser"], sizeof(_httpAuth.wwwUsername));
  strlcpy(_httpAuth.wwwPassword, root["wwwpass"], sizeof(_httpAuth.wwwPassword));

  //check
  DEBUGASYNCWS("httpAuth settings loaded successfully.\r\n");
  DEBUGASYNCWS("Read httpAuth settings from memory:\r\n");
  DEBUGASYNCWS("wwwauth: %d\r\n", _httpAuth.auth);
  DEBUGASYNCWS("wwwuser: %s\r\n", _httpAuth.wwwUsername);
  DEBUGASYNCWS("wwwpass: %s\r\n", _httpAuth.wwwPassword);

  return true;
}

bool save_config()
{
  DEBUGASYNCWS("%s\r\n", __PRETTY_FUNCTION__);

  DynamicJsonBuffer jsonBuffer;
  JsonObject &json = jsonBuffer.createObject();
  json[FPSTR(pgm_ssid)] = _config.ssid;
  json[FPSTR(pgm_password)] = _config.password;

  json[FPSTR(pgm_static_ip)] = _config.static_ip;
  json[FPSTR(pgm_netmask)] = _config.netmask;
  json[FPSTR(pgm_gateway)] = _config.gateway;
  json[FPSTR(pgm_dns0)] = _config.dns0;
  json[FPSTR(pgm_dns1)] = _config.dns1;

  json[FPSTR(pgm_dhcp)] = _config.dhcp;
  json[FPSTR(pgm_ntpserver_0)] = _config.ntpserver_0;
  json[FPSTR(pgm_ntpserver_1)] = _config.ntpserver_1;
  json[FPSTR(pgm_ntpserver_2)] = _config.ntpserver_2;
  json[FPSTR(pgm_syncinterval)] = _config.syncinterval;
  json[FPSTR(pgm_timezone)] = _config.timezone;
  json[FPSTR(pgm_dst)] = _config.dst;
  json[FPSTR(pgm_hostname)] = _config.hostname;

  //json["led"] = config.connectionLed;

  //TODO add AP data to html
  File configFile = SPIFFS.open(FPSTR(pgm_configfilenetwork), "w");
  if (!configFile)
  {
    PRINT("Failed to open config file for writing\r\n");
    configFile.close();
    return false;
  }

#ifndef RELEASE
  String temp;
  json.prettyPrintTo(temp);
  Serial.println(temp);
#endif

  json.printTo(configFile);
  configFile.flush();
  configFile.close();
  return true;
}

// convert a single hex digit character to its integer value (from https://code.google.com/p/avr-netino/)
unsigned char h2int(char c)
{
  if (c >= '0' && c <= '9')
  {
    return ((unsigned char)c - '0');
  }
  if (c >= 'a' && c <= 'f')
  {
    return ((unsigned char)c - 'a' + 10);
  }
  if (c >= 'A' && c <= 'F')
  {
    return ((unsigned char)c - 'A' + 10);
  }
  return (0);
}

String urldecode(String input) // (based on https://code.google.com/p/avr-netino/)
{
  char c;
  String ret = "";

  for (byte t = 0; t < input.length(); t++)
  {
    c = input[t];
    if (c == '+')
      c = ' ';
    if (c == '%')
    {

      t++;
      c = input[t];
      t++;
      c = (h2int(c) << 4) | h2int(input[t]);
    }

    ret.concat(c);
  }
  return ret;
}

void load_running_text()
{

  //String contents = "fail";
  //char contents[512];

  //File runningTextFile = _fs->open(RUNNING_TEXT_FILE, "r");
  File runningTextFile = SPIFFS.open(RUNNING_TEXT_FILE, "r");
  if (!runningTextFile)
  {
    DEBUGLOG("Failed to open running text file");
    //return F("failed");
    //    return false;
    return;
  }

  // this is going to get the number of bytes in the file and give us the value in an integer
  int fileSize = runningTextFile.size();
  //Serial.println(fileSize);
  //int chunkSize=1;
  int chunkSize = 512;
  //This is a character array to store a chunk of the file.
  //We'll store 1024 characters at a time
  // char contents[fileSize];
  char buf[chunkSize];
  int numberOfChunks = (fileSize / chunkSize) + 1;

  // int count = 0;
  int remainingChunks = fileSize;

  int16_t x1Temp, y1Temp;
  uint16_t wTemp, hTemp;

  wText = 0;

  for (int i = 0; i < numberOfChunks; i++)
  {
    if (remainingChunks - chunkSize < 0)
    {
      chunkSize = remainingChunks;
    }
    runningTextFile.read((uint8_t *)buf, chunkSize);
    buf[chunkSize] = '\0';

    //Convert UTF8-string to Extended ASCII
    //utf8ascii(buf);

    matrix.print(buf);

    //contents += String(buf);
    //strcat(contents, buf);
    //buf[0] = (char)0; // clear buffer
    remainingChunks = remainingChunks - chunkSize;
  }

  //char* chr = const_cast<char*>(contents.c_str());
  //matrix.getTextBounds(chr, 0, 0, &x1Temp, &y1Temp, &wTemp, &hTemp);
  matrix.getTextBounds(buf, 0, 0, &x1Temp, &y1Temp, &wTemp, &hTemp);
  //matrix.getTextBounds(contents, 0, 0, &x1Temp, &y1Temp, &wTemp, &hTemp);
  wText = wTemp;

  runningTextFile.close();

  //contents = "";
  //return contents;

  DEBUGLOG("%s\r\n", __PRETTY_FUNCTION__);

  //return F("success");
}

char *formatBytes(size_t bytes)
{
  static char buf[10];
  if (bytes < 1024)
  {
    itoa(bytes, buf, 10);
    strcat(buf, "B");
  }
  else if (bytes < (1024 * 1024))
  {
    itoa(bytes / 1024.0, buf, 10);
    strcat(buf, "KB");
  }
  else if (bytes < (1024 * 1024 * 1024))
  {
    itoa(bytes / 1024.0 / 1024.0, buf, 10);
    strcat(buf, "MB");
  }
  else
  {
    itoa(bytes / 1024.0 / 1024.0 / 1024.0, buf, 10);
    strcat(buf, "GB");
  }
  return buf;
}

bool loadHTTPAuth()
{
  DEBUGASYNCWS("%s\r\n", __PRETTY_FUNCTION__);

  File configFile = SPIFFS.open(SECRET_FILE, "r");
  if (!configFile)
  {
    DEBUGASYNCWS("Failed to open secret file\r\n");
    _httpAuth.auth = false;
    _httpAuth.wwwUsername[0] = '\0';
    _httpAuth.wwwPassword[0] = '\0';
    configFile.close();
    return false;
  }

  size_t size = configFile.size();

  // Allocate a buffer to store contents of the file.
  std::unique_ptr<char[]> buf(new char[size]);

  // We don't use String here because ArduinoJson library requires the input
  // buffer to be mutable. If you don't use ArduinoJson, you may as well
  // use configFile.readString instead.
  configFile.readBytes(buf.get(), size);
  configFile.close();
  DEBUGASYNCWS("JSON secret file size: %d bytes\n", size);
  DynamicJsonBuffer jsonBuffer(256);
  //StaticJsonBuffer<256> jsonBuffer;
  JsonObject &json = jsonBuffer.parseObject(buf.get());

  if (!json.success())
  {
#ifndef RELEASE
    //String temp;
    json.prettyPrintTo(DEBUGPORT);
    PRINT("\r\n");
    PRINT("Failed to parse secret file\r\n");
#endif // RELEASE
    _httpAuth.auth = false;
    return false;
  }
#ifndef RELEASE
  //String temp;
  json.prettyPrintTo(DEBUGPORT);
  PRINT("\r\n");
#endif // RELEASE

  _httpAuth.auth = json["auth"];
  strlcpy(_httpAuth.wwwUsername, json["user"], sizeof(_httpAuth.wwwUsername));
  strlcpy(_httpAuth.wwwPassword, json["pass"], sizeof(_httpAuth.wwwPassword));

  if (_httpAuth.auth)
  {
    DEBUGASYNCWS("User: %s\r\n", _httpAuth.wwwUsername);
    DEBUGASYNCWS("Pass: %s\r\n", _httpAuth.wwwPassword);
  }

