minida28/PrayTime-LedMatrix-ESP8266/src/asyncserver.cpp
  return true;
}

void AsyncWSLoop()
{
  ArduinoOTA.handle();
  dnsServer.processNextRequest();

  // static time_t oldTime = localTime;
  //if (localTime != oldTime) {
  if (tick1000ms)
  {

    //if (ws.hasClient(clientID)) {
    if (ws.hasClient(clientID))
    {
      if (clientVisitNetworkStatusPage)
      {
        //WsSendInfoDynamic(clientID);
        //EventSendNetworkStatus();
        WsSendNetworkStatus();
      }
      else if (clientVisitTimeStatusPage)
      {
        //WsSendInfoDynamic(clientID);
        WsSendTimeStatus();
      }
      else if (clientVisitSystemStatusPage)
      {
        //WsSendInfoDynamic(clientID);
        //EventSendHeap();
        WsSendHeap();
      }
      else if (clientVisitSholatTimePage)
      {
        WsSendSholatDynamic(clientID);
      }
      else if (clientVisitRunningLedConfigPage)
      {
        // do nothing
      }
    }
    else
    {
      clientID = 0;
      clientVisitInfoPage = false;
      clientVisitSholatTimePage = false;
      clientVisitRunningLedConfigPage = false;
    }

    // oldTime = localTime;
  }
}

void WsSendInfoStatic(int clientID)
{
  //  DEBUGLOG("%s\r\n", __PRETTY_FUNCTION__);
  //
  //  DynamicJsonBuffer jsonBuffer;
  //  JsonObject &root = jsonBuffer.createObject();
  //
  //  root[FPSTR(pgm_type)] = FPSTR(pgm_txt_infoStatic);
  //  root[FPSTR(pgm_loc)] = _sholatConfig.citySholat.c_str();
  //  root[FPSTR(pgm_ssid)] = WiFi.SSID();
  //  root[FPSTR(pgm_sta_ip)] = WiFi.localIP().toString();
  //  root[FPSTR(pgm_sta_mac)] = WiFi.macAddress();
  //  root[FPSTR(pgm_ap_ip)] = WiFi.softAPIP().toString();
  //  root[FPSTR(pgm_ap_mac)] = WiFi.softAPmacAddress();
  //  root[FPSTR(pgm_gateway)] = WiFi.gatewayIP().toString();
  //  root[FPSTR(pgm_netmask)] = WiFi.subnetMask().toString();
  //  root[FPSTR(pgm_dns0)] = WiFi.dnsIP().toString();
  //  root[FPSTR(pgm_dns1)] = WiFi.dnsIP(1).toString();
  //  root[FPSTR(pgm_chipid)] = ESP.getChipId();
  //  root[FPSTR(pgm_cpufreq)] = ESP.getCpuFreqMHz();
  //  root[FPSTR(pgm_sketchsize)] = ESP.getSketchSize();
  //  root[FPSTR(pgm_freesketchspace)] = ESP.getFreeSketchSpace();
  //  root[FPSTR(pgm_flashchipid)] = ESP.getFlashChipId();
  //  root[FPSTR(pgm_flashchipsize)] = ESP.getFlashChipSize();
  //  root[FPSTR(pgm_flashchiprealsize)] = ESP.getFlashChipRealSize();
  //  root[FPSTR(pgm_flashchipspeed)] = ESP.getFlashChipSpeed();
  //  root[FPSTR(pgm_cyclecount)] = ESP.getCycleCount();
  //  root[FPSTR(pgm_corever)] = ESP.getCoreVersion();
  //  root[FPSTR(pgm_sdkver)] = ESP.getSdkVersion();
  //  root[FPSTR(pgm_resetreason)] = ESP.getResetReason();
  //  root[FPSTR(pgm_lastboot)] = getLastBootStr();
  //
  //  size_t len = root.measureLength();
  //  char buf[len + 1];
  //  root.printTo(buf, len + 1);
  //
  //  ws.text(clientID, buf);
}

void WsSendInfoDynamic(int clientID)
{
  DEBUGLOG("%s\r\n", __PRETTY_FUNCTION__);

  uint32_t heapstart = ESP.getFreeHeap();

  DynamicJsonBuffer jsonBuffer;
  JsonObject &root = jsonBuffer.createObject();

  root[FPSTR(pgm_type)] = FPSTR(pgm_infodynamic);
  root[FPSTR(pgm_date)] = dayShortStr(weekday(local_time()));
  root[FPSTR(pgm_time)] = getTimeStr(localTime);
  if (_lastSyncd != 0)
  {
    root[FPSTR(pgm_lastsync)] = getLastSyncStr();
    root[FPSTR(pgm_nextsync)] = getNextSyncStr();
  }
  else
  {
    root[FPSTR(pgm_lastsync)] = FPSTR(pgm_never);
    root[FPSTR(pgm_nextsync)] = FPSTR(pgm_never);
  }
  root[FPSTR(pgm_uptime)] = getUptimeStr();
  root[FPSTR(pgm_roomtemp)] = bufTempSensor;
  root[FPSTR(pgm_rtctemp)] = bufRtcTemp;
  root[FPSTR(pgm_heapstart)] = heapstart;
  root[FPSTR(pgm_heapend)] = heapstart;
  uint32_t heapend = ESP.getFreeHeap();
  root[FPSTR(pgm_heapend)] = heapend;

  size_t len = root.measureLength();
  char buf[len + 1];
  root.printTo(buf, len + 1);

  ws.text(clientID, buf);
}

void WsSendSholatStatic(int clientID)
{
  //  DEBUGLOG("%s\r\n", __PRETTY_FUNCTION__);
  //
  //  DynamicJsonBuffer jsonBuffer;
  //  JsonObject &root = jsonBuffer.createObject();
  //
  //  root[FPSTR(pgm_type)] = FPSTR(pgm_sholatstatic);
  //  root[FPSTR(pgm_loc)] = _sholatConfig.citySholat;
  //  root[FPSTR(pgm_day)] = dayNameStr(weekday(local_time()));
  //  root[FPSTR(pgm_date)] = getDateStr(local_time());
  //  root[FPSTR(pgm_fajr)] = sholatTimeArray[0];
  //  root[FPSTR(pgm_syuruq)] = sholatTimeArray[1];
  //  root[FPSTR(pgm_dhuhr)] = sholatTimeArray[2];
  //  root[FPSTR(pgm_ashr)] = sholatTimeArray[3];
  //  root[FPSTR(pgm_maghrib)] = sholatTimeArray[5];
  //  root[FPSTR(pgm_isya)] = sholatTimeArray[6];
  //
  //  size_t len = root.measureLength();
  //  char buf[len + 1];
  //  root.printTo(buf, len + 1);
  //
  //  ws.text(clientID, buf);
}

void WsSendSholatDynamic(int clientID)
{
  DEBUGLOG("%s\r\n", __PRETTY_FUNCTION__);

  DynamicJsonBuffer jsonBuffer;
  JsonObject &root = jsonBuffer.createObject();

  root[FPSTR(pgm_type)] = FPSTR(pgm_sholatdynamic);
  root[FPSTR(pgm_h)] = HOUR;
  root[FPSTR(pgm_m)] = MINUTE;
  root[FPSTR(pgm_s)] = SECOND;
  root[FPSTR(pgm_curr)] = sholatNameStr(CURRENTTIMEID);
  root[FPSTR(pgm_next)] = sholatNameStr(NEXTTIMEID);

  size_t len = root.measureLength();
  char buf[len + 1];
  root.printTo(buf, len + 1);

  ws.text(clientID, buf);
}

void WsSendRunningLedConfig(int clientID)
{
  DEBUGLOG("%s\r\n", __PRETTY_FUNCTION__);

  DynamicJsonBuffer jsonBuffer;
  JsonObject &root = jsonBuffer.createObject();

  root[FPSTR(pgm_type)] = FPSTR(pgm_matrixconfig);
  root[FPSTR(pgm_pagemode0)] = _ledMatrixSettings.pagemode0;
  root[FPSTR(pgm_pagemode1)] = _ledMatrixSettings.pagemode1;
  root[FPSTR(pgm_pagemode2)] = _ledMatrixSettings.pagemode2;
  root[FPSTR(pgm_scrollrow_0)] = _ledMatrixSettings.scrollrow_0;
  root[FPSTR(pgm_scrollrow_1)] = _ledMatrixSettings.scrollrow_1;
  root[FPSTR(pgm_scrollspeedslider)] = _ledMatrixSettings.scrollspeed;
  root[FPSTR(pgm_scrollspeedvalue)] = _ledMatrixSettings.scrollspeed;
  root[FPSTR(pgm_brightnessslider)] = _ledMatrixSettings.brightness;
  root[FPSTR(pgm_brightnessvalue)] = _ledMatrixSettings.brightness;
  char temp[4];
  root[FPSTR(pgm_operatingmode)] = itoa(_ledMatrixSettings.operatingmode, temp, 10);
  if (_ledMatrixSettings.pagemode == Automatic)
  {
    root[FPSTR(pgm_pagemode)] = FPSTR(pgm_automatic);
  }
  else if (_ledMatrixSettings.pagemode == Manual)
  {
    root[FPSTR(pgm_pagemode)] = FPSTR(pgm_manual);
  }

  size_t len = root.measureLength();
  char buf[len + 1];
  root.printTo(buf, len + 1);

  ws.text(clientID, buf);
}
